bendelathouwer/asset-tracker/software/test firmware loratracker/test_firmware_lora_tracker.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32H7
RCC.DIVQ2Freq_Value=200000000
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
ProjectManager.MainLocation=Core/Src
PC15-OSC32_OUT.Mode=LSE-External-Oscillator
PH0-OSC_IN.Locked=true
ProjectManager.ProjectFileName=test_firmware_lora_tracker.ioc
PH0-OSC_IN.Signal=RCC_OSC_IN
RCC.SAI1Freq_Value=137500000
RCC.CortexFreq_Value=550000000
RCC.DIVQ1=4
ProjectManager.KeepUserCode=true
Mcu.PinsNb=8
Mcu.UserName=STM32H735IGKx
I2C4.Speed=100
RCC.HPRE=RCC_HCLK_DIV2
ProjectManager.NoMain=false
RCC.SWPMI1Freq_Value=137500000
RCC.PLLFRACN=0
RCC.SAI4BFreq_Value=137500000
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_I2C4_Init-I2C4-false-HAL-true,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true
PC2.Signal=GPIO_Output
PC3.Locked=true
RCC.D2PPRE2=RCC_APB2_DIV2
RCC.RTCFreq_Value=32000
RCC.D2PPRE1=RCC_APB1_DIV2
ProjectManager.DefaultFWLocation=true
RCC.DIVP2=5
RCC.DIVP1=1
RCC.PLL2FRACN=0
RCC.CpuClockFreq_Value=550000000
RCC.VCO2OutputFreq_Value=400000000
ProjectManager.DeletePrevious=true
PC14-OSC32_IN.Signal=RCC_OSC32_IN
RCC.QSPIFreq_Value=275000000
boardIOC=true
PinOutPanel.RotationAngle=0
PinOutPanel.CurrentBGAView=Top
RCC.FamilyName=M
RCC.MCO1PinFreq_Value=64000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
RCC.AHB4Freq_Value=275000000
RCC.VCOInput3Freq_Value=781250
RCC.SPI6Freq_Value=137500000
PC3.GPIOParameters=GPIO_Label
RCC.D1CPREFreq_Value=550000000
RCC.LPTIM1Freq_Value=137500000
Mcu.IP4=SYS
Mcu.IP2=NVIC
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP3=RCC
RCC.USART234578Freq_Value=137500000
Mcu.IP0=CORTEX_M7
Mcu.IP1=I2C4
RCC.SPI45Freq_Value=137500000
RCC.Tim1OutputFreq_Value=275000000
RCC.SPI123Freq_Value=137500000
Mcu.UserConstants=
ProjectManager.TargetToolchain=STM32CubeIDE
RCC.DIVP3Freq_Value=50390625
RCC.SDMMCFreq_Value=137500000
RCC.VCO1OutputFreq_Value=550000000
Mcu.ThirdPartyNb=0
I2C4.Timing=0x20B0C8FF
RCC.HCLKFreq_Value=275000000
RCC.I2C4Freq_Value=137500000
Mcu.IPNb=5
ProjectManager.PreviousToolchain=
PB9.Mode=I2C
RCC.AXIClockFreq_Value=275000000
RCC.DIVN2=80
RCC.SPDIFRXFreq_Value=137500000
RCC.DIVN1=110
RCC.DIVQ3Freq_Value=50390625
PC3.Signal=GPIO_Output
Mcu.Pin6=PC3
PC2.Locked=true
Mcu.Pin7=VP_SYS_VS_Systick
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=48000000
I2C4.Analog_Filter=I2C_ANALOGFILTER_DISABLE
PC15-OSC32_OUT.Signal=RCC_OSC32_OUT
RCC.CKPERFreq_Value=64000000
PH0-OSC_IN.Mode=HSE-External-Clock-Source
Mcu.Pin0=PB8
Mcu.Pin1=PB9
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PC15-OSC32_OUT
Mcu.Pin3=PC14-OSC32_IN
Mcu.Pin4=PH0-OSC_IN
Mcu.Pin5=PC2
RCC.USBCLockSelection=RCC_USBCLKSOURCE_HSI48
ProjectManager.ProjectBuild=false
RCC.DIVR3Freq_Value=50390625
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
board=STM32H735G-DK
RCC.DIVM2=5
RCC.DIVM1=5
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
ProjectManager.LastFirmware=true
RCC.VCOInput1Freq_Value=5000000
ProjectManager.FirmwarePackage=STM32Cube FW_H7 V1.9.0
MxDb.Version=DB.6.0.21
RCC.AHB12Freq_Value=275000000
RCC.APB2Freq_Value=137500000
RCC.DIVP1Freq_Value=550000000
ProjectManager.BackupPrevious=false
RCC.FMCFreq_Value=275000000
MxCube.Version=6.2.1
PC14-OSC32_IN.Mode=LSE-External-Oscillator
RCC.FDCANFreq_Value=137500000
RCC.RNGFreq_Value=48000000
PC2.GPIOParameters=GPIO_Label
RCC.ADCFreq_Value=80000000
RCC.USART16Freq_Value=137500000
File.Version=6
VP_SYS_VS_Systick.Mode=SysTick
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.FreePins=false
RCC.DIVR2Freq_Value=200000000
RCC.IPParameters=ADCFreq_Value,AHB12Freq_Value,AHB4Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,AXIClockFreq_Value,CECFreq_Value,CKPERFreq_Value,CortexFreq_Value,CpuClockFreq_Value,D1CPREFreq_Value,D1PPRE,D2PPRE1,D2PPRE2,D3PPRE,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVM1,DIVM2,DIVN1,DIVN2,DIVP1,DIVP1Freq_Value,DIVP2,DIVP2Freq_Value,DIVP3Freq_Value,DIVQ1,DIVQ1Freq_Value,DIVQ2Freq_Value,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2Freq_Value,DIVR3Freq_Value,FDCANFreq_Value,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLKFreq_Value,HPRE,I2C123Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPUART1Freq_Value,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,PLL2FRACN,PLL3FRACN,PLLFRACN,PLLSourceVirtual,QSPIFreq_Value,RNGFreq_Value,RTCFreq_Value,SAI1Freq_Value,SAI4AFreq_Value,SAI4BFreq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI123Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,Tim1OutputFreq_Value,Tim2OutputFreq_Value,TraceFreq_Value,USART16Freq_Value,USART234578Freq_Value,USBCLockSelection,USBFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32H735IGKx
RCC.LPTIM2Freq_Value=137500000
ProjectManager.HalAssertFull=false
RCC.DIVP2Freq_Value=80000000
ProjectManager.ProjectName=test_firmware_lora_tracker
ProjectManager.UnderRoot=true
RCC.APB3Freq_Value=137500000
ProjectManager.CoupleFile=false
RCC.MCO2PinFreq_Value=550000000
RCC.SYSCLKFreq_VALUE=550000000
Mcu.Package=UFBGA176
PB9.Signal=I2C4_SDA
RCC.I2C123Freq_Value=137500000
RCC.PLL3FRACN=0
NVIC.ForceEnableDMAVector=true
RCC.D1PPRE=RCC_APB3_DIV2
KeepUserPlacement=false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.CompilerOptimize=6
ProjectManager.ToolChainLocation=
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
ProjectManager.HeapSize=0x200
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.DFSDMFreq_Value=137500000
RCC.DIVR1Freq_Value=275000000
RCC.LPTIM345Freq_Value=137500000
ProjectManager.ComputerToolchain=false
RCC.LTDCFreq_Value=50390625
RCC.SAI4AFreq_Value=137500000
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
PB8.Mode=I2C
RCC.TraceFreq_Value=64000000
RCC.APB4Freq_Value=137500000
RCC.CECFreq_Value=32000
RCC.DIVQ1Freq_Value=137500000
PB8.Signal=I2C4_SCL
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PC3.GPIO_Label=GOLED
RCC.D3PPRE=RCC_APB4_DIV2
RCC.LPUART1Freq_Value=137500000
RCC.HCLK3ClockFreq_Value=275000000
RCC.VCOInput2Freq_Value=5000000
RCC.APB1Freq_Value=137500000
PC2.GPIO_Label=ERRORLED
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DeviceId=STM32H735IGKx
RCC.Tim2OutputFreq_Value=275000000
ProjectManager.LibraryCopy=1
RCC.DFSDMACLkFreq_Value=137500000
I2C4.IPParameters=Timing,Speed,Analog_Filter
RCC.VCO3OutputFreq_Value=100781250
isbadioc=false
